"(optional)" = "(valinnainen)";
"Address Book:" = "Osoitekirja:";
"Apply Coupon" = "Käytä kuponkia";
"Buy Later" = "Myöhemmin";
"Buy Now" = "Osta nyt";
"Cancel" = "Kumoa";
"Card Number:" = "Kortin numero:";
"City:" = "Kaupunki:";
"Close" = "Sulje";
"Company Name:" = "Yhtiön nimi:";
"Confirm Email:" = "Vahvista sähköpostiosoite:";
"Country:" = "Maa:";
"Coupon Code:" = "Kupongin koodi:";
"Coupon:" = "Kuponki:";
"Credit Card" = "Luottokortti";
"Credit Card Type:" = "Luottokortin tyyppi:";
"Done" = "Valmis";
"Email Address:" = "Sähköpostiosoite:";
"Email Support" = "Sähköpostituki";
"Enter your name and licence key to activate this software." = "Kirjaa nimesi ja lisenssiavaimesi aktivoidaksesi tämän ohjelmiston.";
"Expiration Date:" = "Vanhentumispäiväys:";
"FAX_MESSAGE" = "You can pay by credit card, check, or purchase order.\n\nPrint out the form and mail your order to:\n\nCocoatech\n4255 24th St.\nSan Francisco, CA 94114";
"Fax, Mail or Purchase Order" = "Faksi, posti tai ostotilaus";
"First Name:" = "Etunimi:";
"Full Version" = "Täysi versio";
"Home Address" = "Kotiosoite";
"In order to qualify for the upgrade price, you must have a valid license key from a previous version of this software." = "Päivityshinnan hyödyntäminen edellyttää tämän ohjelman aikaisemman version voimassaolevan lisenssin omistamista.";
"Last Name:" = "Sukunimi:";
"License Key:" = "Lisenssiavain:";
"Login to PayPal" = "Kirjaudu PayPaliin";
"Mail or Purchase Order" = "Posti- tai ostotilaus";
"Name on Card:" = "Nimi kortilla:";
"Name:" = "Nimi:";
"Next" = "Seuraava";
"Number of Users:" = "Käyttäjien määrä:";
"Office Address" = "Toimisto-osoite";
"Order Summary:" = "Yhteenveto tilauksesta:";
"PAYPAL_MESSAGE" = "Purchasing with PayPal is very simple. Click the button below, and a sheet will appear where you can login to PayPal and make a payment.\n\nIf you feel more comfortable using your default internet browser to make a payment using PayPal, <a href=\"mkcl://kMKCShowPayPalInDefaultBrowser\">click here</a>.\nIf you use your default internet browser, you will have to enter your license key by hand once you receive the email.";
"PREPAID_MESSAGE" = "If you received a prepaid coupon code, enter it here.";
"Pay by Fax, Mail or Purchase Order" = "Maksa faksilla, postilla tai ostotilauksella";
"Pay using Credit Card" = "Maksa luottokortilla";
"Pay using PayPal" = "Maksa PayPalillä";
"Pay using Prepaid Code" = "Maksa etukäteen ostetulla koodilla";
"Phone Number:" = "Puhelinnumero:";
"Place Order" = "Tee tilaus";
"Postal/Zip Code:" = "Postinumero:";
"Prepaid Code" = "Etukäteen maksettu koodi";
"Prepaid Code:" = "Etukäteen maksettu koodi:";
"Previous" = "Edellinen";
"Pricing Information:" = "Hinnoittelutiedot:";
"Primary Address" = "Ensisijainen osoite";
"Print" = "Tulosta";
"Print Form" = "Tulosta lomake";
"Quit" = "Lopeta";
"Secure Purchasing System" = "Turvallinen ostojärjestelmä";
"Security Code:" = "Turvaluku:";
"State/Province:" = "Osavaltio/Kunta:";
"Street Address:" = "Katuosoite:";
"Submit Code" = "Lähetä koodi";
"Subscribe to the Path Finder newsletter" = "Tilaa sähköinen Path Finder ilmoituslehti";
"THANKYOU_MESSAGE" = "Your purchase has completed successfully!\n\nYour computer is now licensed to use Path Finder, and your license information has been saved.\n\nClick the print button below to print out your license key and keep it in a safe place, you may need this if you change machines or reinstall the OS.\n\nWe have emailed your license key to your email address: ##USERS_EMAIL##.\nYou will not have to do anything with this email, your registration code has already been set, but print it out so you have record of your purchase.\n\nYour license information can be viewed in Path Finder's About box.  Choose \"About Path Finder\" located in the Path Finder menu in your menu bar.\n\nThank you again!  If you have questions or problems, please let us know! Send us an <a href=\"mailto:help@cocoatech.com\">email</a>.";
"THANKYOU_TITLE" = "Thank you for purchasing Path Finder!";
"Tab" = "Välilehti";
"To pay using a different method, go back to the previous step and choose a different payment method." = "Jos haluat valita erilaisen maksutavan, palaa edelliseen vaiheeseen ja valitse eri maksutapa.";
"Update" = "Päivitä";
"Upgrade" = "Päivitä";
"View" = "Näkymä";
"WELCOME_MESSAGE" = "Your support is greatly appreciated!  Path Finder is continually being updated and improved because of support from users like yourself.\n\nYou can purchase using credit card, PayPal, fax, purchase order or mail.\n\nIf you already have a license key and need to activate it <a href=\"mkcl://kMKCEnterLicenseKey\">click here</a>.\n\nIf you have questions, feel free to send us an <a href=\"mailto:help@cocoatech.com\">email</a>.";
"WELCOME_TITLE" = "Purchasing Path Finder is simple!";
"What kind of license do you want?" = "Minkälaisen lisenssin haluat?";
"Your details are secured in transfer with 128-bit SSL encryption." = "Tietosi salataan lähetyksessä 128-bittisellä SSL-salauksella.";
"not licensed" = "ei lisensioitu";

/* ==== UNLOCALIZED ==== */

"American Express" = "American Express";
"Diners Club" = "Diners Club";
"Discover Card" = "Discover Card";
"JCB" = "JCB";
"MasterCard" = "MasterCard";
"OK" = "OK";
"PayPal" = "PayPal";
"Visa" = "Visa";
